gigwegbe/example-standalone-st-stm32n6/edgeimpulse/ei_main.cpp
/* The Clear BSD License
*
* Copyright (c) 2025 EdgeImpulse Inc.
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted (subject to the limitations in the disclaimer
* below) provided that the following conditions are met:
*
*   * Redistributions of source code must retain the above copyright notice,
*   this list of conditions and the following disclaimer.
*
*   * Redistributions in binary form must reproduce the above copyright
*   notice, this list of conditions and the following disclaimer in the
*   documentation and/or other materials provided with the distribution.
*
*   * Neither the name of the copyright holder nor the names of its
*   contributors may be used to endorse or promote products derived from this
*   software without specific prior written permission.
*
* NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY
* THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
* CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
* LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
* PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
* CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
* EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
* BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER
* IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*/

/* Include ----------------------------------------------------------------- */
#include "edge-impulse-sdk/classifier/ei_run_classifier.h"
#include "edge-impulse-sdk/porting/ei_classifier_porting.h"
#include "model-parameters/model_variables.h"
#include "stm32n6xx_hal.h"
#if defined(USE_NS_TIMER) && (USE_NS_TIMER == 1)
#include "timer_config.h"
#endif

/* Private variables ------------------------------------------------------- */
static const float features[] = {
    // copy raw features here
};

int raw_feature_get_data(size_t offset, size_t length, float *out_ptr)
{
#if EI_CLASSIFIER_SENSOR == EI_CLASSIFIER_SENSOR_CAMERA
    size_t index = 0;
    uint32_t value;
    uint8_t* out_byte_ptr = (uint8_t*)out_ptr;
    //memcpy(out_ptr, features + offset, length * sizeof(float));
    for (size_t ix = 0; ix < (length/3); ix++) {
        value = (uint32_t)features[offset + ix];

        out_byte_ptr[index++] = (uint8_t)((value >> 16) & 0xFF);
        out_byte_ptr[index++] = (uint8_t)((value >> 8) & 0xFF);
        out_byte_ptr[index++] = (uint8_t)(value & 0xFF);

    }
#else
    memcpy(out_ptr, features + offset, length * sizeof(float));
    uint8_t* out_byte_ptr = (uint8_t*)out_ptr;
#endif
    return 0;
}

/**
 * 
 */
extern "C" int ei_main(void)
{
    ei_impulse_result_t result = {nullptr};

    ei_printf("Edge Impulse standalone inferencing (ST STM32N6570-DK)\n");
    ei_printf("SystemCoreClock: %ld\n", SystemCoreClock);

    if (sizeof(features) / sizeof(float) != EI_CLASSIFIER_DSP_INPUT_FRAME_SIZE) {
        ei_printf("The size of your 'features' array is not correct. Expected %d items, but had %u\n",
                EI_CLASSIFIER_DSP_INPUT_FRAME_SIZE, sizeof(features) / sizeof(float));
        return 1;
    }
        
    // the features are stored into flash, and we don't want to load everything into RAM
    signal_t features_signal;
    features_signal.total_length = sizeof(features) / sizeof(features[0]);
    features_signal.get_data = &raw_feature_get_data;

    do {
        // invoke the impulse
        EI_IMPULSE_ERROR res = run_classifier(&features_signal, &result, false);

        if (res != 0) {
            ei_printf("Error while running classifier: %d\n", res);
            return 1;
        }

        display_results(&ei_default_impulse, &result);
        ei_sleep(2000);
    }while(1);

    return  0;
}

#if defined(USE_NS_TIMER) && (USE_NS_TIMER == 1)
__attribute__((weak)) uint64_t ei_read_timer_ms() {
    return timer_config_read_us()/1000;
}

__attribute__((weak)) uint64_t ei_read_timer_us() {
    return timer_config_read_us();
}
#endif
